Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Both C1 and C2 are type parameters for two container types to be determined when the function is called.
ja: C1とC2の両方は、２つのコンテナ型のための型パラメータで、関数が呼ばれるときに決定されます。

source: Both playerInformation.health and playerInformation.energy are passed as in-out parameters, which means balance(_:_:) needs write access to them for the duration of the function call.
ja: playerInformation.healthとplayerInformation.energyの両方ともin-outパラメータとして渡されます、それはbalance(_:_:)がそれらへの書き込みアクセスを関数呼び出しの期間中に必要とすることを意味します。

source: Both an empty tuple expression and an empty tuple type are written () in Swift.
ja: 空のタプル式と空のタプル型は両方とも、()とスウィフトでは書かれます。

source: Both can:
ja: 両方とも以下のことができます：

source: Both classes correctly conform to the HasArea protocol.
ja: 両方のクラスは、正しくHasAreaプロトコルに従います。

source: Both constants can now be used independently:
ja: 両方の定数は、今や独立して使われることができます：

source: Both designated initializers must call the single designated initializer from the superclass, to satisfy rule 1 from above.
ja: 上記の規則１を満たすために、両方の指定イニシャライザは、スーパークラスからその１つだけある指定イニシャライザを呼ばなければなりません。

source: Both functions are generic because the types they rely on are generic, and the type parameters to the function pass along the type information needed by FlippedShape and JoinedShape.
ja: 両方の関数は総称体です、なぜならそれらが頼りにする型が総称体であるからです、そして関数への型パラメータは、FlippedShapeとJoinedShapeによって必要とされる型情報を伝達します。

source: Both functions have a type of (Int) -> Int:
ja: 両方の関数は、(Int) -> Intの型を持ちます：

source: Both initializers can be used to create a new Color instance, by providing named values for each initializer parameter:
ja: 両方のイニシャライザとも、新しいColorインスタンスを作成するために、各イニシャライザ・パラメータに名前を付けられた値を提供することで、使用されることができます：

source: Both initializers convert their single argument into the corresponding Celsius value and store this value in a property called temperatureInCelsius.
ja: 両方のイニシャライザは、それらのただ１つの引数を相当する摂氏の値に変えて、その値をtemperatureInCelsiusと呼ばれるプロパティに保管します。

source: Both integers and floats can be padded with extra zeros and can contain underscores to help with readability.
ja: 整数と浮動小数点は、余分のゼロを詰められることができ、読みやすくするためにアンダースコアを含むことができます。

source: Both of these classes also define a deinitializer, which prints the fact that an instance of that class is being deinitialized.
ja: これらのクラスの両方ともデイニシャライザを定義します、それは、そのクラスのインスタンスがデイニシャライズされているという事実を出力します。

source: Both of these extended grapheme clusters are valid ways to represent the character é, and so they’re considered to be canonically equivalent:
ja: これらの拡張書記素クラスタの両方とも、文字éを表わす有効な方法です、そういうわけでそれらは正準等価とみなされます：

source: Both of these representations qualify as a single Character value in Swift:
ja: これらの表し方の双方とも、スウィフトでは単一のCharacter値としての基準を満たします：

source: Both of these variables have an initial value of nil, by virtue of being optional:
ja: オプショナルである利点によって、これらの変数の両方とも、nilの初期値を持ちます：

source: Both patterns include a binding for distance and distance is an integer in both patterns—which means that the code in the body of the case can always access a value for distance.
ja: 両方のパターンは、distanceに対する束縛を含みます、そしてdistanceは両方のパターンにおいて整数です—それはcaseの本文のコードは常にdistanceに対する値にアクセスできることを編みします。

source: Both place their entire definition within a pair of braces:
ja: 両方とも、それらの全ての定義を一対の波括弧の範囲内に置きます：

source: Both properties are inferred to be of type Double by assigning a default value of 0.0.
ja: 両方のプロパティは、省略時の値の0.0を代入することによってDouble型であると推測されます。

source: Both protocols are adopted by a structure called Person.
ja: 両方のプロトコルは、Personと呼ばれる構造体によって採用されます。

source: Both the protocol and the optional requirement must be marked with the @objc attribute.
ja: プロトコルとオプショナル要件の両方は、@objc属性で印されなければなりません。

source: Braces around the body are required.
ja: 本文のまわりの波括弧は必須です。

source: Branch Statements
ja: 分岐文

source: Branch statements allow the program to execute certain parts of code depending on the value of one or more conditions.
ja: 分岐文は、プログラムが１つ以上の条件の値に従いコードの特定の部分を実行するようにします。

source: Break Statement
ja: ブレーク文

source: Break in a Loop Statement
ja: ループ文の中断

source: Break in a Switch Statement
ja: switch文の中断

source: Bridging lets you use an expression of a Swift standard library type such as String as its corresponding Foundation type such as NSString without needing to create a new instance.
ja: ブリッジは、あなたにStringのようなスウィフト標準ライブラリ型の式を、NSStringのようなそれの対応しているFoundation型として使用させます、新しいインスタンスを作成する必要なしに。

source: But if you provide a setter clause, you must also provide a getter clause.
ja: しかしあなたがセッター節を提供するならば、あなた同様にゲッター節を提供しなければなりません。

source: By constraining a collection’s elements to the Equatable protocol, a part of the standard library, you can use the == and != operators to check for equality and inequality between two elements.
ja: あるコレクションの持つ要素をEquatableプロトコル、標準ライブラリの１つ、に制約することで、あなたは==と!=演算子を使って同等性と同一性を２つの要素間で確認できます。

source: By contrast, C requires you to insert an explicit break statement at the end of every switch case to prevent fallthrough.
ja: 対照的に、Cはあなたに抜け落ちること（フォールスルー）を防ぐために明示的にbreak文をあらゆるswitchケース節の終わりに書き入れることを要求します。

source: By creating an extension on the protocol, all conforming types automatically gain this method implementation without any additional modification.
ja: 拡張をプロトコル上に作成することによって、すべての準拠している型が自動的にこのメソッド実装をなんら追加の修正なしに手に入れます。

source: By default, Swift assigns the raw values starting at zero and incrementing by one each time, but you can change this behavior by explicitly specifying values.
ja: 初期状態で、スウィフトはゼロで開始して毎回１つ増加させながら生の値を割り当てます、しかしあなたは明示的にそれらの値を指定することでこの挙動を変更できます。

source: By default, Swift prevents unsafe behavior from happening in your code.
ja: 初期状態では、スウィフトはあなたのコードにおける偶発事由来の安全でない挙動を防止します。

source: By default, a closure expression captures constants and variables from its surrounding scope with strong references to those values.
ja: 初期状態では、クロージャ式は、それの囲んでいるスコープから定数や変数をそれらの値への強い参照を使ってキャプチャします。

source: By default, any new Bicycle instance you create will not have a basket.
ja: 特に何もしなければ、あなたが作成するあらゆる新しいBicycleインスタンスは、入れ物かごを持ちません。

source: By default, custom classes and structures don’t have an implementation of the equivalence operators, known as the equal to operator (==) and not equal to operator (!=).
ja: 初期状態では、あつらえのクラスと構造体は、「同等」演算子（==）そして「不等」演算子（!=）として知られる、等価演算子の実装を持ちません。

source: By default, floating-point literals are expressed in decimal (with no prefix), but they can also be expressed in hexadecimal (with a 0x prefix).
ja: 初期状態で、浮動小数点リテラルは10進において（接頭辞なしで）表されます、しかしそれらはまた、16進法において（0x接頭辞で）表されることができます。

source: By default, functions use their parameter names as labels for their arguments.
ja: 特に何もしなくとも、関数はそれらのパラメータ名をそれらの引数のラベルとして使います。

source: By default, initializers declared in a superclass are not inherited by subclasses.
ja: 初期状態では、スーパークラスで宣言されるイニシャライザは、サブクラスによって継承されません。

source: By default, integer literals are expressed in decimal; you can specify an alternate base using a prefix.
ja: 初期状態では、整数リテラルは10進法で表されます；あなたは、接頭辞を使用して代替の基数を指定することができます。

source: By default, most declarations are implicitly marked with the internal access-level modifier.
ja: 省略時では、大部分の宣言は暗黙的にinternalアクセス水準修飾子で印されます。

source: By default, only entities marked as open or public are accessible to other modules.
ja: 特に何もしない状態では、開放または公開と印される実在だけが他のモジュールに利用可能です。

source: By default, parameter names are also used as argument labels.
ja: 特に何もしなければ、パラメータ名はまた引数ラベルとしても使われます。

source: By default, parameters use their parameter name as their argument label.
ja: 特に何もしなければ、パラメータはそれらのパラメータ名をそれらの引数ラベルとして使います。

source: By default, the asHTML property is assigned a closure that returns a string representation of an HTML tag.
ja: 特に何もしなければ、asHTMLプロパティは、あるHTMLタグの文字列表現を返すクロージャを代入されます。

source: By default, the ~= operator compares two values of the same type using the == operator.
ja: 初期状態で、~=演算子は、同じ型の２つの値を==演算子を使用して比較します。

source: By default, the function terminates the line it prints by adding a line break.
ja: 初期状態では、この関数はそれが出力する行を改行を加えて終わります。

source: By default, the parameters used in subscripting don’t have argument labels, unlike functions, methods, and initializers.
ja: 初期状態で、添字において使用されるパラメータは引数ラベルを持ちません、関数、メソッド、およびイニシャライザとは違って。

source: By default, the properties of a value type cannot be modified from within its instance methods.
ja: 初期状態では、ある値型に属するプロパティは、それのインスタンスメソッド内から修正されることができません。

source: By default, types that conform to a protocol must implement all properties, methods, and subscripts declared in the protocol.
ja: 初期状態では、あるプロトコルに準拠する型は、そのプロトコルにおいて宣言される全てのプロパティ、メソッド、そして添え字を実装しなければなりません。

source: By default, variables, constants, and other named declarations that are declared at the top-level of a source file are accessible to code in every source file that is part of the same module.
ja: 初期状態では、あるソースファイルのトップレベルで宣言される変数、定数、そして他の名前をつけられる宣言は、同じモジュールの一部であるすべてのソースファイルの中のコードにアクセス可能です。

source: By including arguments to the property wrapper, you can set up the initial state in the wrapper or pass other options to the wrapper when it’s created.
ja: 引数をプロパティラッパーに含めることによって、あなたは初期状態をラッパーにおいて準備することまたは他のオプションをラッパーに渡すことが、それが作成される時に可能です。

source: By making if x = y invalid, Swift helps you to avoid these kinds of errors in your code.
ja: if x = yを無効にすることによって、スウィフトはあなたがこれらの種類のエラーをあなたのコードにおいて避けるのを手伝います。

source: By returning a tuple with two distinct values, each of a different type, the function provides more useful information about its outcome than if it could only return a single value of a single type.
ja: ２つの別の値をそれぞれ異なる型で持つひとつのタプルを返すことによって、その関数は、それが１つの型の１つの値を返すことができるだけよりも、その結果に関するより役に立つ情報を提供します。

source: By their nature, two instantaneous accesses can’t happen at the same time.
ja: 本質的に、２つの即時アクセスは同時に起こりえません。

source: By wrapping the function call in a do statement, any errors that are thrown will be propagated to the provided catch clauses.
ja: その関数呼び出しをdo文の中に包み込むことによって、スローされるどんなエラーも添付のcatch節に伝えられるようになります。

source: Call a function by following its name with a list of arguments in parentheses.
ja: 関数は、その名前の後に丸括弧に入れた引数の目録（リスト）を続けることで呼び出します。

source: Call one of the initializers declared within the class, as described in Initializers.
ja: そのクラス内で宣言されるイニシャライザのうちの１つを呼び出す、イニシャライザで記述されるように。

source: Call one of the initializers declared within the structure, as described in Initializers.
ja: その構造体の内部で宣言されるイニシャライザの内の１つを呼び出す、イニシャライザで記述されるように。

source: Calling Methods Through Optional Chaining
ja: オプショナル連鎖を通してメソッドを呼ぶ

source: Calling it with playerOneScore and playerTwoScore as arguments doesn’t produce a conflict—there are two write accesses that overlap in time, but they access different locations in memory.
ja: それをplayerOneScoreとplayerTwoScoreを引数として使って呼び出すことは衝突を生み出しません — 時間内にオーバーラップする２つの書き込みアクセスがあります、しかしそれらはメモリ中の異なる位置にアクセスします。

source: Calling the function multiple times shows this behavior in action:
ja: この関数を複数回呼ぶことは、活動中にこの挙動を示します：

source: Calling the original incrementer (incrementByTen) again continues to increment its own runningTotal variable, and does not affect the variable captured by incrementBySeven:
ja: 最初のインクリメンタ（incrementByTen）を再び呼ぶことは、それ独自のrunningTotal変数を増加させることを継続します、そしてincrementBySevenによってキャプチャされる変数に影響しません。

source: Calling the superclass’s initializer.
ja: スーパークラスのイニシャライザを呼ぶ。

source: Calling this initializer returns a Rect instance whose origin and size properties are both initialized with the default values of Point(x: 0.0, y: 0.0) and Size(width: 0.0, height: 0.0) from their property definitions:
ja: このイニシャライザを呼ぶことはRectインスタンスを返します、それは、originとsizeプロパティが両方ともそれらのプロパティ定義からの省略時の値のPoint(x: 0.0, y: 0.0)とSize(width: 0.0, height: 0.0)で初期化されるものです：

source: Calls to a throwing function or method must be wrapped in a try or try! expression (that is, in the scope of a try or try! operator).
ja: スロー関数またはメソッドに対する呼び出しは、tryまたはtry!式の中に（即ち、tryまたはtry!演算子のスコープの中に）包まれなければなりません。

source: Capture Lists
ja: キャプチャリスト

source: Capturing Values
ja: 値を捕獲する

source: Capturing by reference ensures that runningTotal and amount do not disappear when the call to makeIncrementer ends, and also ensures that runningTotal is available the next time the incrementer function is called.
ja: 参照を捕獲することは、makeIncrementerへの呼び出しが終わる時にrunningTotalとamountが消えてなくならないことを確かにします、そしてまたincrementer関数が呼ばれる次の時にrunningTotalが利用可能であることを確実にもします。

# Carriage return ()
source: Carriage return (\r)
ja: キャリッジリターン「復帰文字」（\r）

source: Cases can match many different patterns, including interval matches, tuples, and casts to a specific type.
ja: それらのケース節は、区間マッチ、タプル、そして特定の型への型キャストを含む、多くの異なるパターンにマッチすることができます。

source: Casting does not actually modify the instance or change its values.
ja: キャストは、実際にインスタンスを修正したり、その値を変えたりしません。

source: Chaining on Methods with Optional Return Values
ja: オプショナルの戻り値をもつメソッド上で連鎖する

source: Change optionalName to nil.
ja: optionalNameをnilに変えてください。

source: Change the printer name to "Never Has Toner", so that the send(job:toPrinter:) function throws an error.
ja: プリンタ名を"Never Has Toner"に変更してください、そうするとsend(job:toPrinter:)関数はエラーをスローします。

source: Changing the value of currentDirection thereafter doesn’t affect the copy of the original value that was stored in rememberedDirection.
ja: それ以降にcurrentDirectionの値を変えることは、本来の値のコピーに、rememberedDirectionに格納されたものに影響を及ぼしません。

source: Changing the value of properties defined by the superclass.
ja: スーパークラスによって定義されるプロパティの値を変える。

source: Characteristics of Memory Access
ja: メモリアクセスの特徴

source: Checking API Availability
ja: API有効性の確認

source: Checking Type
ja: 型を調べる

source: Checking for Protocol Conformance
ja: プロトコル準拠の確認

source: Checking for an empty string value (such as "" rather than "Giraffe") is not the same as checking for nil to indicate the absence of an optional String value.
ja: 空の文字列値（例えば"Giraffe"といったものでなく""）について調べることは、オプショナルのString値の不在を指し示すnilについて調べることと同じではありません。

source: Checking for and casting to a protocol follows exactly the same syntax as checking for and casting to a type:
ja: あるプロトコルについて調べたりそれにキャストすることは、ある型について調べたりキャストするのと正確に同じ構文に従います：

source: Checking the frameRate property of tenEighty shows that it correctly reports the new frame rate of 30.0 from the underlying VideoMode instance:
ja: tenEightyのframeRateプロパティを調べてみると、それが根底にあるVideoModeインスタンス由来の新しいフレームレートの30.0を正しく報告することがわかります：

source: Checking the width property of cinema shows that it has indeed changed to be 2048:
ja: cinemaのwidthプロパティをチェックすると、2048になるように変えられたことを示します：

source: Chess is played on an 8 x 8 board, with alternating black and white squares.
ja: チェスは、黒と白の正方形を互い違いに持つ、８×８マスの盤上で行われます。

source: Clarified the full list of characters that can be used when defining Custom Operators.
ja: あつらえの演算子を定義するとき使われることが出来る文字の完全なリストをわかりやすくしました。

source: Class B is a subclass of A, with a reduced access level of “internal”.
ja: クラスBはAのサブクラスです、そして減少させられたアクセス水準の「内部」を持ちます。

source: Class Declaration
ja: クラス宣言

source: Class Implementations of Protocol Initializer Requirements
ja: イニシャライザ要件プロトコルのクラス実装

source: Class Inheritance and Initialization
ja: クラス継承と初期化

source: Class and structure initialization is described in more detail in Initialization.
ja: クラスと構造体の初期化は、更に詳細に初期化で記述されます。

source: Class declarations are declared using the class keyword and have the following form:
ja: クラス宣言は、キーワードclassを使用して宣言されて、以下の形式を持ちます：

source: Class declarations can’t contain protocol declarations.
ja: クラス宣言は、プロトコル宣言を含むことができません。

source: Class definitions can have at most one deinitializer per class.
ja: クラス定義は、クラスごとに多くとも１つのデイニシャライザしか持つことができません。

source: Class initialization in Swift is a two-phase process.
ja: スウィフトでのクラス初期化は、２段階処理です。

source: Class types can inherit from a single superclass and conform to any number of protocols.
ja: クラス型は、１つのスーパークラスから継承することができ、任意の数のプロトコルに準拠することができます。

source: Class-Only Protocols
ja: クラス専用プロトコル

source: Classes Are Reference Types
ja: クラスは、参照型です

source: Classes and class members that are marked with the internal or public access-level modifier are imported as if they were declared with the open access-level modifier.
ja: internalまたはpublicアクセス水準修飾子で印されるクラスまたはクラスメンバは、まるでそれらがopenアクセス水準修飾子で宣言されたかのようにインポートされます。

source: Classes and structures must set all of their stored properties to an appropriate initial value by the time an instance of that class or structure is created.
ja: クラスと構造体は、それらの格納プロパティの全てを、そのクラスや構造体のインスタンスがつくられる時には適切な初期値に設定する必要があります。

source: Classes and structures can also provide implementations of the standard unary operators.
ja: クラスと構造体は、また、標準の単項演算子の実施も提供することができます。

source: Classes and structures can provide their own implementations of existing operators.
ja: クラスと構造体は、既存の演算子のそれら独自の実装を提供することができます。

source: Classes are reference types; instances of a class are referred to, rather than copied, when assigned to variables or constants, or when passed as arguments to a function call.
ja: クラスは、参照型です；クラスのインスタンスは、変数または定数に代入されるとき、または関数呼び出しに対する引数として渡されるときに、コピーされるのではなく、参照されます。

source: Classes can also add property observers to inherited properties in order to be notified when the value of a property changes.
ja: クラスはまた、プロパティの値が変化するとき通知されるように継承されたプロパティにプロパティオブザーバー（監視者）を加えることができます。

source: Classes can mark type computed properties with the class declaration modifier instead to allow subclasses to override the superclass’s implementation.
ja: クラスは、型計算プロパティを代わりにclass宣言修飾子で印をつけて、サブクラスがスーパークラスの実装をオーバーライドすることを許可することができます。

source: Classes can use the class keyword instead, to allow subclasses to override the superclass’s implementation of that method.
ja: クラスは代わりにclassキーワードを使って、サブクラスにスーパークラスのもつそのメソッドの実装をオーバーライドすることを許可できます。

source: Classes can use the class keyword instead, to allow subclasses to override the superclass’s implementation of that subscript.
ja: クラスは、classキーワードを代わりに使用して、サブクラスにスーパークラスのもつその添え字の実装のオーバーライドを許可できます。

source: Classes can’t use an opaque type as the return type of a nonfinal method.
ja: クラスは、不透明型を非最終メソッドの戻り型として使用できません。

source: Classes do not have a default memberwise initializer, and so the Food class provides a designated initializer that takes a single argument called name.
ja: これらのクラスには省略時のメンバー関連イニシャライザがありません、なので、Foodクラスはnameと呼ばれる１つの引数をとる指定イニシャライザを提供します。

source: Classes have additional capabilities that structures don’t have:
ja: クラスは以下の追加の能力を持ちます、それは構造体が持たないものです：

source: Classes in Swift can call and access methods, properties, and subscripts belonging to their superclass and can provide their own overriding versions of those methods, properties, and subscripts to refine or modify their behavior.
ja: スウィフトのクラスは、それらのスーパークラスに属しているメソッド、プロパティ、そして添え字の呼び出しやアクセスが行えて、それらのメソッド、プロパティ、そして添え字の独自の優先的に使われる改変板を提供することでそれらの挙動の洗練や修正を行えます。

source: Classes tend to have very few designated initializers, and it is quite common for a class to have only one.
ja: クラスはほとんど指定イニシャライザを持たない傾向があります、そして、あるクラスが１つだけしか持たないことは全く普通です。

source: Classes you define without specifying a superclass automatically become base classes for you to build upon.
ja: スーパークラスを指定することなくあなたが定義するクラスは、自動的に基盤クラスになり、あなたが基礎とするために使えます。

source: Classes, enumerations, and structs can all adopt protocols.
ja: クラス、列挙、そして構造体は、全てそのようなプロトコルを採用することができます。

source: Classes, however, can inherit from other classes, as described in Inheritance.
ja: クラスはしかし、継承で記述されるように、他のクラスから継承することができます。

source: Classes, structures, and enumerations can all define instance methods, which encapsulate specific tasks and functionality for working with an instance of a given type.
ja: それぞれのクラス、構造体、および列挙は、すべてインスタンスメソッドを定義することができます、それは、ある定められた型のあるインスタンスで働くために特定の作業や機能性をカプセル化します。

source: Classes, structures, and enumerations can also define type methods, which are associated with the type itself.
ja: クラス、構造体、および列挙は、また、型メソッドを定義することができます、それは型それ自身に結び付けられます。

source: Classes, structures, and enumerations can define subscripts, which are shortcuts for accessing the member elements of a collection, list, or sequence.
ja: クラス、構造体、および列挙は、添え字を定義することができます、それは、コレクション、リスト、またはシーケンスのメンバー要素にアクセスするための近道です。

source: Closed Range Operator
ja: 完結範囲演算子

source: Closed ranges are also available, by using stride(from:through:by:) instead:
ja: 完結範囲も利用可能です、代わりにstride(from:through:by:)を使うことで：

source: Closure Expression
ja: クロージャ式

source: Closure Expression Syntax
ja: クロージャ式構文

source: Closure Expressions
ja: クロージャ式

source: Closure expression syntax has the following general form:
ja: クロージャ式構文は、以下の一般的な形式を持ちます：

source: Closure expressions are unnamed closures written in a lightweight syntax that can capture values from their surrounding context.
ja: クロージャ式は、それの周囲の前後関係から値を捕獲することができる軽快な構文で書かれる無名のクロージャです。

source: Closure expressions can be used without being stored in a variable or constant, such as when you immediately use a closure as part of a function call.
ja: クロージャ式は、変数や定数の中に格納されることなく利用できます、例えばあなたが直接にクロージャを関数呼び出しの一部として使う場合など。

source: Closure expressions provide several syntax optimizations for writing closures in a shortened form without loss of clarity or intent.
ja: クロージャ式は、いくつかの構文最適化を、ある省略形式で明快さや意図の損失なしでクロージャを書くために提供します。

source: Closures
ja: クロージャ

source: Closures Are Reference Types
ja: クロージャは参照型です

source: Closures can capture and store references to any constants and variables from the context in which they are defined.
ja: クロージャは、それが定義されている前後関係からのあらゆる定数や変数への参照を捕獲して、格納することができます。

source: Closures in Swift are similar to blocks in C and Objective-C and to lambdas in other programming languages.
ja: スウィフトにおけるクロージャは、CとObjective-Cでのブロックに、そして他のプログラミング言語でのラムダ（lambda）に似ています。

source: Closures take one of three forms:
ja: クロージャは、３つの書式のうちの１つをとります：

source: Code Blocks
ja: コード・ブロック

source: Code that interacts with an opaque value can use the value only in ways that are part of the interface defined by the constraint.
ja: 不透明型と相互作用するコードは、constraintによって定義されるインターフェイスの一部であるやり方それらにおいてのみ値を使うことができます。

source: Code that uses this property wrapper, can’t specify a different initial value for a property that’s wrapped by TwelveOrLess—for example, the definition of SmallRectangle can’t give height or width initial values.
ja: このプロパティラッパーを使うコードは、TwelveOrLessによってラップされるプロパティに対して異なる初期値を指定できません — 例えば、SmallRectangleに対する定義はheightやwidthに初期値を与えることができません。

source: Code that’s compiled in library evolution mode, code in the standard library, Swift overlays for Apple frameworks, and C and Objective-C code can declare nonfrozen enumerations.
ja: ライブラリ進化モードでコンパイルされるコード、標準ライブラリでのコード、Appleフレームワークに対するスウィフトオーバーレイ、そしてCとObjective-Cコードは、非凍結列挙を宣言できます。

source: Code that’s written anywhere else accesses the value using the getter and setter for wrappedValue, and can’t use number directly.
ja: どこか他で書かれるコードは、wrappedValueに対するゲッターとセッターを使って値にアクセスします、そしてnumberを直接に使用できません。

source: Code written at global scope is used as the entry point for the program, so you don’t need a main() function.
ja: グローバルなスコープで書かれるコードは、プログラムのエントリポイントとして使われるので、あなたはmain()関数を必要としません。

source: Collection Types
ja: コレクション型

source: Collections defined by the standard library like arrays, dictionaries, and strings use an optimization to reduce the performance cost of copying.
ja: 配列、辞書、そして文字列のような、標準ライブラリによって定義されるコレクションは、ある最適化を使うことでコピーすることによる性能損失を減らします。

source: Collections of Protocol Types
ja: プロトコル型のコレクション

source: Combining Logical Operators
ja: 論理演算子を結合する

source: Comments
ja: コメント

source: Comments are ignored by the Swift compiler when your code is compiled.
ja: あなたのコードがコンパイルされるとき、コメントはスウィフトのコンパイラによって無視されます。

source: Comments are not statements and do not cause a switch case to be ignored.
ja: コメントは、文でなくて、switchケース節を無視されるようにはしません。

source: Comments are treated as whitespace by the compiler.
ja: コメントは、コンパイラによって空白とみなされます。

source: Comments can contain additional formatting and markup, as described in Markup Formatting Reference [https://developer.apple.com/library/content/documentation/Xcode/Reference/xcode_markup_formatting_ref/index.html].
ja: コメントは、さらに追加の書式とマークアップを含む事が、Markup Formatting Reference [https://developer.apple.com/library/content/documentation/Xcode/Reference/xcode_markup_formatting_ref/index.html]で記述されるように可能です。

source: Comments in Swift are very similar to comments in C. Single-line comments begin with two forward-slashes (//):
ja: スウィフトのコメントは、Cのコメントに非常に似ています。一行コメントは２つのスラッシュで始まります（//）：
